#როგორ გამოვიყენოთ ჩვენს პროექტში ვერსიების კონტროლის სისტემა?


#როდესაც პროექტი ახალი შექმნილია, პროექტში ვერსიების კონტროლის
#სისტემა რომ დავაყენოტ , ტერმინალში უნდა დავწეროთ git init 
#(დაიმახსოვრეთ ეს მხოლოდ ხდება ერთხელ)



#მე რომ შევქმნა ახალი ვერსია მანამდე საჭიროა ავირჩიო ის ფაილები რომელიც მინდა რომ
#ახალ ვერსიაში მოთავსდეს და ამას ვაკეთებთ git add . (დაიმახსოვრეთ ტყოველ ახალ 
#განახლებაზე საჭიროა ამის გაკეთება)



#მე რომ ახალი ვერსია შევქმნა უნდა დავწერო ისევ ტერმინალში git commit -m "ვერსიის სახელი
#რაც გინდათ რომ ერქვას" git commit ქმნის ახალ ვერსიას ხოლო -m მაძლევს საშუალებას ტერმინალიდან 
#ვერსიას დავარქვა სახელი"





#github ის რეპოზიტორიის დაკავშირება ჩვენს ფოლდერთან





#ვქმნით რეპოზიტორიას github ზე

#ტერმინალში ვწერთ ბოლო 3 ბრძანებას რომელიც ახალი
#რეპოზიტორიის შექმნის შემდეგ ამოგიგცდოთ
